9zigen/NRF52_PhSensor/ble_services.c
#include <stdbool.h>
#include <stdint.h>
#include <string.h>
#include <ble/ble_services/ble_lbs/ble_lbs.h>
#include <libraries/timer/app_timer.h>
#include <nrfx_saadc.h>
#include <sensors/include/ntc_temperature_sensor.h>
#include <sensors/include/ph_sensor.h>

#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble_services.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "fds.h"
#include "peer_manager.h"
#include "peer_manager_handler.h"
#include "ble_conn_state.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "nrf_pwr_mgmt.h"
#include "ble_bas.h"

#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"

#include "ble_cus.h"
#include "ble_services.h"
#include "timers.h"
#include "bat_sensor.h"
#include "pwm.h"
#include "sensors.h"

#define DEVICE_NAME                     "PHSens"                                /**< Name of device. Will be included in the advertising data. */
#define MANUFACTURER_NAME               "NordicSemiconductor"                   /**< Manufacturer. Will be passed to Device Information Service. */
#define APP_ADV_INTERVAL                MSEC_TO_UNITS(180, UNIT_0_625_MS)       /**< The advertising interval (in units of 0.625 ms. This value corresponds to 187.5 ms). */
#define APP_ADV_SLOW_INTERVAL           MSEC_TO_UNITS(1280, UNIT_0_625_MS)      /**< The advertising interval (in units of 0.625 ms. This value corresponds to 187.5 ms). */

#define APP_ADV_DURATION                1800                                    /**< The advertising duration (180 seconds) in units of 10 milliseconds. */
#define APP_ADV_SLOW_DURATION           BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED   /**< The advertising duration (180 seconds) in units of 10 milliseconds. */
#define APP_BLE_OBSERVER_PRIO           3                                       /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define APP_BLE_CONN_CFG_TAG            1                                       /**< A tag identifying the SoftDevice BLE configuration. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(100, UNIT_1_25_MS)        /**< Minimum acceptable connection interval (0.1 seconds). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(200, UNIT_1_25_MS)        /**< Maximum acceptable connection interval (0.2 second). */
#define SLAVE_LATENCY                   0                                       /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)         /**< Connection supervisory timeout (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)                   /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000)                  /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define SEC_PARAM_BOND                  1                                       /**< Perform bonding. */
#define SEC_PARAM_MITM                  0                                       /**< Man In The Middle protection not required. */
#define SEC_PARAM_LESC                  0                                       /**< LE Secure Connections not enabled. */
#define SEC_PARAM_KEYPRESS              0                                       /**< Keypress notifications not enabled. */
#define SEC_PARAM_IO_CAPABILITIES       BLE_GAP_IO_CAPS_NONE                    /**< No I/O capabilities. */
#define SEC_PARAM_OOB                   0                                       /**< Out Of Band data not available. */
#define SEC_PARAM_MIN_KEY_SIZE          7                                       /**< Minimum encryption key size. */
#define SEC_PARAM_MAX_KEY_SIZE          16                                      /**< Maximum encryption key size. */

#define DEAD_BEEF                       0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */

#define ADV_INTERVAL                    APP_TIMER_TICKS(10000)

NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                         /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                             /**< Advertising module instance. */
BLE_CUS_DEF(ble_cus);                                                           /**< Custom service instance. */
BLE_BAS_DEF(m_bas);                                                             /**< Battery service instance. */

typedef union {
  uint64_t u64;
  uint32_t u32[2];
  uint16_t u16[4];
  uint8_t  u8[8];
} u64_to_u8_t;

typedef union {
  uint32_t u32;
  uint16_t u16[2];
  uint8_t  u8[4];
} u32_to_u8_t;

typedef union {
  uint16_t u16;
  uint8_t  u8[2];
} u16_to_u8_t;

static uint8_t manuf_data_array[5];

static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */

static ble_uuid_t m_adv_uuids[] =                                               /**< Universally unique service identifiers. */
{
  {CUSTOM_SERVICE_UUID, BLE_UUID_TYPE_VENDOR_BEGIN}
//  {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE},
//  {BLE_UUID_BATTERY_SERVICE, BLE_UUID_TYPE_VENDOR_BEGIN},
};



/* Callback function for asserts in the SoftDevice. */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
  app_error_handler(DEAD_BEEF, line_num, p_file_name);
}


/* Function for handling Peer Manager events. */
void pm_evt_handler(pm_evt_t const * p_evt)
{
  pm_handler_on_pm_evt(p_evt);
  pm_handler_flash_clean(p_evt);

  switch (p_evt->evt_id)
  {
    case PM_EVT_PEERS_DELETE_SUCCEEDED:
      advertising_start();
      break;

    default:
      break;
  }
}

/* Function for handling the Battery Service events. */
static void on_bas_evt(ble_bas_t * p_bas, ble_bas_evt_t * p_evt)
{
  switch (p_evt->evt_type)
  {
    case BLE_BAS_EVT_NOTIFICATION_ENABLED:
      update_sensor_characteristic_start(BATTERY_SENSOR);
      break;

    case BLE_BAS_EVT_NOTIFICATION_DISABLED:
      update_sensor_characteristic_stop(BATTERY_SENSOR);
      break;

    default:
      // No implementation needed.
      break;
  }
}


