9zigen/NRF52_PhSensor/ble_services.c
/* Function for initializing the Battery Service. */
static void bas_init(void)
{
  ret_code_t     err_code;
  ble_bas_init_t bas_init_obj;

  memset(&bas_init_obj, 0, sizeof(bas_init_obj));

  bas_init_obj.evt_handler          = on_bas_evt;
  bas_init_obj.support_notification = true;
  bas_init_obj.p_report_ref         = NULL;
  bas_init_obj.initial_batt_level   = 100;

  bas_init_obj.bl_rd_sec        = SEC_OPEN;
  bas_init_obj.bl_cccd_wr_sec   = SEC_OPEN;
  bas_init_obj.bl_report_rd_sec = SEC_OPEN;

  err_code = ble_bas_init(&m_bas, &bas_init_obj);
  APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
void gap_params_init(void)
{
  ret_code_t              err_code;
  ble_gap_conn_params_t   gap_conn_params;
  ble_gap_conn_sec_mode_t sec_mode;

  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

  err_code = sd_ble_gap_device_name_set(&sec_mode,
                                        (const uint8_t *)DEVICE_NAME,
                                        strlen(DEVICE_NAME));
  APP_ERROR_CHECK(err_code);

  /* YOUR_JOB: Use an appearance value matching the application's use case.
     err_code = sd_ble_gap_appearance_set(BLE_APPEARANCE_);
     APP_ERROR_CHECK(err_code); */

  memset(&gap_conn_params, 0, sizeof(gap_conn_params));

  gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
  gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
  gap_conn_params.slave_latency     = SLAVE_LATENCY;
  gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

  err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
  APP_ERROR_CHECK(err_code);
}


/**@brief Function for initializing the GATT module.
 */
void gatt_init(void)
{
  ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
  APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
void nrf_qwr_error_handler(uint32_t nrf_error)
{
  APP_ERROR_HANDLER(nrf_error);
}

static void on_cus_evt(ble_cus_t * p_bas, ble_cus_evt_t * p_evt)
{
  NRF_LOG_INFO("CUS Event Handler, event type %d\r\n", p_evt->evt_type);

  switch(p_evt->evt_type)
  {
    case BLE_CUS_EVT_TEMPERATURE_NOTIFICATION_ENABLED:
      update_sensor_characteristic_start(TEMPERATURE_SENSOR);
      break;

    case BLE_CUS_EVT_PH_NOTIFICATION_ENABLED:
      update_sensor_characteristic_start(PH_SENSOR);
      break;

    case BLE_CUS_EVT_TEMPERATURE_NOTIFICATION_DISABLED:
      update_sensor_characteristic_stop(TEMPERATURE_SENSOR);
      break;

    case BLE_CUS_EVT_PH_NOTIFICATION_DISABLED:
      update_sensor_characteristic_stop(PH_SENSOR);
      break;

    case BLE_CUS_EVT_CONNECTED:

      break;

    case BLE_CUS_EVT_DISCONNECTED:
      break;
//    case BLE_CUS_EVT_SERVO:
//      err_code = app_pwm_channel_duty_set(&PWM1, 0, p_evt->duty_cycle);
//      APP_ERROR_CHECK(err_code);
//      break;

    default:
      // No implementation needed.
      break;
  }
}


/**@brief Function for initializing services that will be used by the application.
 */
void services_init(void)
{
  ret_code_t         err_code;
  nrf_ble_qwr_init_t qwr_init = {0};
  ble_cus_init_t     cus_init = {0};

  // Initialize Queued Write Module.
  qwr_init.error_handler = nrf_qwr_error_handler;

  err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
  APP_ERROR_CHECK(err_code);

  // Initialize CUS Service init structure to zero.
  cus_init.evt_handler                = on_cus_evt;

  /* ToDo: Add Encription */
  /* Status */
  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init.status_char_attr_md.cccd_write_perm);
  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init.status_char_attr_md.read_perm);
  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init.status_char_attr_md.write_perm);
  cus_init.initial_status_value = 0;

  /* Temperature */
  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init.temperature_char_attr_md.cccd_write_perm);
  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init.temperature_char_attr_md.read_perm);
  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init.temperature_char_attr_md.write_perm);
  cus_init.initial_temperature_value = 25;

  /* PH */
  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init.ph_char_attr_md.cccd_write_perm);
  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init.ph_char_attr_md.read_perm);
  BLE_GAP_CONN_SEC_MODE_SET_OPEN(&cus_init.ph_char_attr_md.write_perm);
  cus_init.initial_ph_value = 7;

  err_code = ble_cus_service_init(&ble_cus, &cus_init);
  APP_ERROR_CHECK(err_code);

  bas_init();
}


/**@brief Function for handling the Connection Parameters Module.
 *
 * @details This function will be called for all events in the Connection Parameters Module which
 *          are passed to the application.
 *          @note All this function does is to disconnect. This could have been done by simply
 *                setting the disconnect_on_fail config parameter, but instead we use the event
 *                handler mechanism to demonstrate its use.
 *
 * @param[in] p_evt  Event received from the Connection Parameters Module.
 */
void on_conn_params_evt(ble_conn_params_evt_t * p_evt)
{
  ret_code_t err_code;

  if (p_evt->evt_type == BLE_CONN_PARAMS_EVT_FAILED)
  {
    err_code = sd_ble_gap_disconnect(m_conn_handle, BLE_HCI_CONN_INTERVAL_UNACCEPTABLE);
    APP_ERROR_CHECK(err_code);
  }
}


/**@brief Function for handling a Connection Parameters error.
 *
 * @param[in] nrf_error  Error code containing information about what went wrong.
 */
void conn_params_error_handler(uint32_t nrf_error)
{
  APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for initializing the Connection Parameters module.
 */
void conn_params_init(void)
{
  ret_code_t             err_code;
  ble_conn_params_init_t cp_init;

  memset(&cp_init, 0, sizeof(cp_init));

  cp_init.p_conn_params                  = NULL;
  cp_init.first_conn_params_update_delay = FIRST_CONN_PARAMS_UPDATE_DELAY;
  cp_init.next_conn_params_update_delay  = NEXT_CONN_PARAMS_UPDATE_DELAY;
  cp_init.max_conn_params_update_count   = MAX_CONN_PARAMS_UPDATE_COUNT;
  cp_init.start_on_notify_cccd_handle    = BLE_GATT_HANDLE_INVALID;
  cp_init.disconnect_on_fail             = false;
  cp_init.evt_handler                    = on_conn_params_evt;
  cp_init.error_handler                  = conn_params_error_handler;

