9zigen/NRF52_PhSensor/ble_services.c
  err_code = ble_conn_params_init(&cp_init);
  APP_ERROR_CHECK(err_code);
}

/* Function for handling advertising events. */
void on_adv_evt(ble_adv_evt_t ble_adv_evt)
{
  switch (ble_adv_evt)
  {
    case BLE_ADV_EVT_FAST:
      NRF_LOG_INFO("Fast advertising.");
      led_indication_set(LED_INDICATE_ADVERTISING);
      break;

    case BLE_ADV_EVT_SLOW:
      NRF_LOG_INFO("Fast advertising.");
      led_indication_set(LED_INDICATE_ADVERTISING_SLOW);
      break;

    case BLE_ADV_EVT_IDLE:
      NRF_LOG_INFO("IDLE advertising.");
      led_indication_set(LED_INDICATE_IDLE);
      break;

    default:
      break;
  }
}

/**@brief Function for handling BLE events.
 *
 * @param[in]   p_ble_evt   Bluetooth stack event.
 * @param[in]   p_context   Unused.
 */
void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context)
{
  ret_code_t err_code = NRF_SUCCESS;

  switch (p_ble_evt->header.evt_id)
  {
    case BLE_GAP_EVT_DISCONNECTED:
      NRF_LOG_INFO("Disconnected.");
      led_indication_set(LED_INDICATE_CONNECTED);
      break;

    case BLE_GAP_EVT_CONNECTED:
      NRF_LOG_INFO("Connected.");
      led_indication_set(LED_INDICATE_CONNECTED);
      m_conn_handle = p_ble_evt->evt.gap_evt.conn_handle;
      err_code = nrf_ble_qwr_conn_handle_assign(&m_qwr, m_conn_handle);
      APP_ERROR_CHECK(err_code);
      break;

    case BLE_GAP_EVT_PHY_UPDATE_REQUEST:
    {
      NRF_LOG_DEBUG("PHY update request.");
      ble_gap_phys_t const phys =
          {
              .rx_phys = BLE_GAP_PHY_AUTO,
              .tx_phys = BLE_GAP_PHY_AUTO,
          };
      err_code = sd_ble_gap_phy_update(p_ble_evt->evt.gap_evt.conn_handle, &phys);
      APP_ERROR_CHECK(err_code);
    } break;

    case BLE_GATTC_EVT_TIMEOUT:
      // Disconnect on GATT Client timeout event.
      NRF_LOG_DEBUG("GATT Client Timeout.");
      err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gattc_evt.conn_handle,
                                       BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
      APP_ERROR_CHECK(err_code);
      break;

    case BLE_GATTS_EVT_TIMEOUT:
      // Disconnect on GATT Server timeout event.
      NRF_LOG_DEBUG("GATT Server Timeout.");
      err_code = sd_ble_gap_disconnect(p_ble_evt->evt.gatts_evt.conn_handle,
                                       BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
      APP_ERROR_CHECK(err_code);
      break;

    default:
      // No implementation needed.
      break;
  }
}

/*Function for initializing the BLE stack. */
void ble_stack_init(void)
{
  ret_code_t err_code;

  err_code = nrf_sdh_enable_request();
  APP_ERROR_CHECK(err_code);

  // Configure the BLE stack using the default settings.
  // Fetch the start address of the application RAM.
  uint32_t ram_start = 0;
  err_code = nrf_sdh_ble_default_cfg_set(APP_BLE_CONN_CFG_TAG, &ram_start);
  APP_ERROR_CHECK(err_code);

  // Enable BLE stack.
  err_code = nrf_sdh_ble_enable(&ram_start);
  APP_ERROR_CHECK(err_code);

  // Register a handler for BLE events.
  NRF_SDH_BLE_OBSERVER(m_ble_observer, APP_BLE_OBSERVER_PRIO, ble_evt_handler, NULL);
}


/**@brief Function for the Peer Manager initialization.
 */
void peer_manager_init(void)
{
  ble_gap_sec_params_t sec_param;
  ret_code_t           err_code;

  err_code = pm_init();
  APP_ERROR_CHECK(err_code);

  memset(&sec_param, 0, sizeof(ble_gap_sec_params_t));

  // Security parameters to be used for all security procedures.
  sec_param.bond           = SEC_PARAM_BOND;
  sec_param.mitm           = SEC_PARAM_MITM;
  sec_param.lesc           = SEC_PARAM_LESC;
  sec_param.keypress       = SEC_PARAM_KEYPRESS;
  sec_param.io_caps        = SEC_PARAM_IO_CAPABILITIES;
  sec_param.oob            = SEC_PARAM_OOB;
  sec_param.min_key_size   = SEC_PARAM_MIN_KEY_SIZE;
  sec_param.max_key_size   = SEC_PARAM_MAX_KEY_SIZE;
  sec_param.kdist_own.enc  = 1;
  sec_param.kdist_own.id   = 1;
  sec_param.kdist_peer.enc = 1;
  sec_param.kdist_peer.id  = 1;

  err_code = pm_sec_params_set(&sec_param);
  APP_ERROR_CHECK(err_code);

  err_code = pm_register(pm_evt_handler);
  APP_ERROR_CHECK(err_code);
}


/**@brief Clear bond information from persistent storage.
 */
void delete_bonds(void)
{
  ret_code_t err_code;

  NRF_LOG_INFO("Erase bonds!");

  err_code = pm_peers_delete();
  APP_ERROR_CHECK(err_code);

}


///**@brief Function for handling events from the BSP module.
// *
// * @param[in]   event   Event generated when button is pressed.
// */
//void bsp_event_handler(bsp_event_t event)
//{
//  ret_code_t err_code;
//
//  switch (event)
//  {
//    case BSP_EVENT_SLEEP:
////      sleep_mode_enter();
//      break; // BSP_EVENT_SLEEP
//
//    case BSP_EVENT_DISCONNECT:
//      err_code = sd_ble_gap_disconnect(m_conn_handle,
//                                       BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);
//      if (err_code != NRF_ERROR_INVALID_STATE)
//      {
//        APP_ERROR_CHECK(err_code);
//      }
//      break; // BSP_EVENT_DISCONNECT
//
//    case BSP_EVENT_WHITELIST_OFF:
//      if (m_conn_handle == BLE_CONN_HANDLE_INVALID)
//      {
//        err_code = ble_advertising_restart_without_whitelist(&m_advertising);
//        if (err_code != NRF_ERROR_INVALID_STATE)
//        {
//          APP_ERROR_CHECK(err_code);
//        }
//      }
//      break; // BSP_EVENT_KEY_0
//
//    default:
//      break;
//  }
//}

/* Advertising  data format */

/* Function for initializing the Advertising functionality. */
void advertising_init(void)
{
  ret_code_t             err_code;
  ble_advertising_init_t init;

  memset(&init, 0, sizeof(init));

  ble_advdata_manuf_data_t manuf_data; //Variable to hold manufacturer specific data

  /* Our data to advertise */

  /* Data Format
   * bat_%(8bit) ->
   * temp_x100(16bit) ->
   * ph_x100(16bit) ->
   * soil(16bit) ->
   * ec(16bit) = 9 byte */

  u16_to_u8_t temperature;
  temperature.u16                     = (uint16_t ) (get_ntc_temperature()*100);

  u16_to_u8_t ph;
  ph.u16                              = (uint16_t ) (get_ph_value()*100);

  NRF_LOG_INFO("Temp x100 %d", temperature.u16 );
  NRF_LOG_INFO("PH   x100 %d", ph.u16);

  uint8_t data[5];

